phase4-test/src/test/resources/testfiles/NoResponder.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!--

    Copyright (C) 2015-2024 Philip Helger (www.helger.com)
    philip[at]helger[dot]com

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

            http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->
<S12:Envelope xmlns:S12="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:eb="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/">
	<S12:Header>
		<eb:Messaging S12:mustUnderstand="true"
			id="_9ecb9d3c-cef8-4006-ac18-f425c5c7ae3d">
			<eb:UserMessage>
				<eb:MessageInfo>
					<eb:Timestamp>2011-04-03T14:49:28.886Z</eb:Timestamp>
					<eb:MessageId>2011-921@5209999001264.example.com</eb:MessageId>
				</eb:MessageInfo>
				<eb:PartyInfo>
					<eb:From>
						<eb:PartyId type="urn:oasis:names:tc:ebcore:partyid-type:iso6523:0088">
							5209999001264</eb:PartyId>
						<eb:Role>Seller</eb:Role>
					</eb:From>
				</eb:PartyInfo>
				<eb:CollaborationInfo>
					<eb:Service>http://docs.oasis-open.org/ebxml-msg/as4/200902/service
					</eb:Service>
					<eb:Action>http://docs.oasis-open.org/ebxml-msg/as4/200902/action
					</eb:Action>
					<eb:ConversationId>2011-921</eb:ConversationId>
				</eb:CollaborationInfo>
				<eb:PayloadInfo>
					<eb:PartInfo href="#_f8aa8b55-b31c-4364-94d0-3615ca65aa40" />
				</eb:PayloadInfo>
			</eb:UserMessage>
		</eb:Messaging>
		<wsse:Security S12:mustUnderStand="true">
			<!-- Content omitted -->
		</wsse:Security>
	</S12:Header>
	<S12:Body wsu:Id="_f8aa8b55-b31c-4364-94d0-3615ca65aa40">
		<CrossIndustryInvoice xmlns="urn:un:unece:uncefact:data:standard:CrossIndustryInvoice:2">
			<!-- content omitted -->
		</CrossIndustryInvoice>
	</S12:Body>
</S12:Envelope>